travellogue_backend/app/Http/Controllers/PostController.php

    public function index(Request $request){
        $posts = Post::where('user_id', '=', \Auth::id())->get();

    //    呼び出したpostのidをpost_idとして持っている画像データをそれぞれ用意して、postとセットで返す処理を記述
        $post_ids = Post::where('user_id', \Auth::id())->get('id');
        $posts_images_data = Post::where('user_id', '=' ,\Auth::id())->with('images')->get();
---
select * from `posts` where `user_id` = 1
select `id` from `posts` where `user_id` = 1
select * from `post_images` where `post_images`.`post_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109)